## Regiment
#### Introduction:
Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

## Step 1. Import the necessary libraries

In [20]:
import pandas as pd
import numpy as np

## Step 2. Create the DataFrame with the following values:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

## Step 3. Assign it to a variable called regiment.
#Don't forget to name each column

In [3]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [30]:
regiment.dtypes

regiment         object
company          object
name             object
preTestScore      int64
postTestScore     int64
dtype: object

## Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [11]:
regiment[regiment.regiment=="Nighthawks"].preTestScore.mean()
#or
#regiment[regiment['regiment'] == 'Nighthawks'].groupby('regiment').mean().preTestScore

15.25

## Step 5. Present general statistics by company

In [32]:
regiment.groupby(['company']).describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

## Step 6. What is the mean of each company's preTestScore?

In [33]:
regiment.groupby(['company']).preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

## Step 7. Present the mean preTestScores grouped by regiment and company

In [35]:
regiment.groupby(['regiment','company']).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

## Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [36]:
regiment_result = regiment.groupby(['regiment','company']).preTestScore.mean()
regiment_result.columns = ['_'.join(cols).lower()
                     for cols in regiment_result.columns.to_flat_index()]
#.head(10)

AttributeError: 'Series' object has no attribute 'columns'

In [43]:
regiment_result = regiment.groupby(['regiment','company']).preTestScore.mean()
regiment_result.columns()

AttributeError: 'Series' object has no attribute 'columns'

In [56]:
#new_regiment =( regiment.groupby(['regiment','company'],as_index=False).preTestScore.mean()
#              )
new_regiment =( regiment.groupby(['regiment','company'],as_index=False).agg({'preTestScore':['mean']}    )        
              )
new_regiment.columns

#** imp note, you can't save a dataframe until you do '',as_index=False' and put it in '()'

# or 
#https://pbpython.com/groupby-agg.html

#multi_df = df.groupby(['embark_town', 'class'],
#                    as_index=False).agg({'fare': ['sum', 'mean']})
#multi_df.columns = [
#'_'.join(col).rstrip('_') for col in multi_df.columns.values
#]

MultiIndex([(    'regiment',     ''),
            (     'company',     ''),
            ('preTestScore', 'mean')],
           )

In [57]:
new_regiment.columns = ['_'.join(cols).lower()
                     for cols in new_regiment.columns.to_flat_index()]

In [58]:
new_regiment

    regiment_ company_  pretestscore_mean
0    Dragoons      1st                3.5
1    Dragoons      2nd               27.5
2  Nighthawks      1st               14.0
3  Nighthawks      2nd               16.5
4      Scouts      1st                2.5
5      Scouts      2nd                2.5

In [19]:
regiment.groupby(['regiment','company'].agg{'preTestScore':['mean']}
https://stackoverflow.com/questions/36340080/python-doing-multiple-column-aggregation-in-pandas

AttributeError: 'list' object has no attribute 'agg'

In [62]:
#regiment.groupby(['regiment', 'company']).preTestScore.mean()

regiment.groupby(['regiment', 'company']).preTestScore.mean().unstack()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

## Step 9. Group the entire dataframe by regiment and company

In [64]:
regiment.groupby(['regiment','company']).mean()# why mean here though and why an aggregate function, can we do without it?

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

## Step 10. What is the number of observations in each regiment and company

In [69]:
#regiment.groupby(['regiment','company']).count()
regiment.groupby(['regiment','company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

## Step 11. Iterate over a group and print the name and the whole data from the regiment

In [72]:
## Difficult question - counldn't do it myself
## Very interseting though
# Group the dataframe by regiment, and for each regiment,
for name, group in regiment.groupby('regiment'):
    # print the name of the regiment
    print(name)
    # print the data of that regiment
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [73]:
regiment.groupby('regiment').describe()

           preTestScore                                                  \
                  count   mean        std  min   25%   50%    75%   max
regiment
Dragoons            4.0  15.50  14.153916  3.0  3.75  14.0  25.75  31.0
Nighthawks          4.0  15.25  14.453950  2.0  3.50  14.0  25.75  31.0
Scouts              4.0   2.50   0.577350  2.0  2.00   2.5   3.00   3.0

           postTestScore
                   count  mean        std   min   25%   50%   75%   max
regiment
Dragoons             4.0  61.5  28.757608  25.0  49.0  63.5  76.0  94.0
Nighthawks           4.0  59.5  28.242993  25.0  49.0  59.5  70.0  94.0
Scouts               4.0  66.0   4.618802  62.0  62.0  66.0  70.0  70.0

In [ ]:

Looking at the results, we have 6 hierarchical columns i.e. sum and mean for Employees (highlighted in yellow) and min, max columns for Revchange. We can convert the hierarchical columns to non-hierarchical columns using the .to_flat_index method which was introduced in the pandas 0.24 version. 


Now as per the requirement let us map the column names from the data set to the syntax.

Grouping columns – ‘Sector’, ‘Industry’
Aggregate columns – ‘Employees’, ‘Revchange’
Aggregate functions – ‘sum’, ‘mean’, ‘min’ ”max3.   Getting the results by applying the above syntax.
df_result = (df
           .groupby(['Sector','Industry'])
           .agg({'Employees':['sum', 'mean'],
                 'Revchange':['min','max']}))
  
# printing top 15 rows
df_result.head(15)

In [ ]:
Looking at the results, we have 6 hierarchical columns i.e. sum and mean for Employees (highlighted in yellow) and min, max columns for Revchange. We can convert the hierarchical columns to non-hierarchical columns using the .to_flat_index method which was introduced in the pandas 0.24 version. 

df_result.columns = ['_'.join(cols).lower()
                     for cols in df_result.columns.to_flat_index()]
df_result.head(10)